{"what is software security?": "Software security is a kind of computer security that focuses on the secure design and implementation of software.", "what is cyber security about?": "Cyber Security also known as computer security is the practice/study of protecting systems, networks, and programs from digital attacks.", "who and what are the main figures in cyber security?": "There are mainly 3 figures in cyber security:  The User, the software/ operating system and the hacker.", "what does a cyber security person do?": "Cybersecurity analysts help prevent attacks through their knowledge of databases, networks, hardware, firewalls and encryption. They also keep intruders away from personal information or accessing important data.", "what are cyber risks?": "Cyber risks can be referred to as any risks that are connected with financial loss resulting from the failure of its information technology systems or because of unauthorized access to informational data.", "what kinds of undesired behaviors are there?": "There are 3 types of undesired behaviors:  stealing information which is the opposite of confidentiality, modifying information or functionality which is the opposite of integrity and denying access which is the opposite of availability.", "what is Confidentiality in cyber security?": "Confidentiality is roughly equivalent to privacy. Measures undertaken to ensure confidentiality are designed to prevent sensitive information from reaching the wrong people, while making sure that the right people can in fact get it.", "what is functionality in cyber security?": "Measures undertaken to ensure confidentiality are designed to prevent unauthorized modification of information, installation of unwanted software and destroying records or data.", "what is availability in cyber security?": "Measures undertaken to ensure availability are designed to prevent denying access like when a user is unable to purchase products or for example when a user is Unable to access banking information.", "what is the difference between a flaw and a bug?": "A flaw and a bug are both defects in a system but they are different types of defects: a flaw is a defect in the design but a bug is a defect in the implementation.", "what is python programming language": "Python is an interpreted, high-level, general-purpose programming language. Created by Guido van Rossum and first released in 1991, Python has a design philosophy that emphasizes code readability, notably using significant whitespace. It provides constructs that enable clear programming on both small and large scales. Van Rossum led the language community until stepping down as leader in July 2018.Python features a dynamic type system and automatic memory management. It supports multiple programming paradigms, including object-oriented, imperative, functional and procedural. It also has a comprehensive standard library.Python interpreters are available for many operating systems. CPython, the reference implementation of Python, is open source software and has a community-based development model, as do nearly all of Python's other implementations. Python and CPython are managed by the non-profit Python Software Foundation.", "who is tim berners-lee": "Sir Timothy John Berners-Lee  (born 8 June 1955), also known as TimBL, is an English engineer and computer scientist, best known as the inventor of the World Wide Web. He is currently a professor of computer science at the University of Oxford and the Massachusetts Institute of Technology (MIT). He made a proposal for an information management system on March 12, 1989, and he implemented the first successful communication between a Hypertext Transfer Protocol (HTTP) client and server via the internet in mid-November the same year.Berners-Lee is the director of the World Wide Web Consortium (W3C), which oversees the continued development of the Web. He is also the founder of the World Wide Web Foundation and is a senior researcher and holder of the 3Com founders chair at the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL). He is a director of the Web Science Research Initiative (WSRI), and a member of the advisory board of the MIT Center for Collective Intelligence. In 2011, he was named as a member of the board of trustees of the Ford Foundation. He is a founder and president of the Open Data Institute, and is currently an advisor at social network MeWe.In 2004, Berners-Lee was knighted by Queen Elizabeth II for his pioneering work. In April 2009, he was elected a foreign associate of the United States National Academy of Sciences. Named in Time magazine's list of the 100 Most Important People of the 20th century, Berners-Lee has received a number of other accolades for his invention. He was honoured as the \"Inventor of the World Wide Web\" during the 2012 Summer Olympics opening ceremony, in which he appeared in person, working with a vintage NeXT Computer at the London Olympic Stadium. He tweeted \"This is for everyone\", which instantly was spelled out in LCD lights attached to the chairs of the 80,000 people in the audience. Berners-Lee received the 2016 Turing Award \"for inventing the World Wide Web, the first web browser, and the fundamental protocols and algorithms allowing the Web to scale\".", "who is donald trump": "The family of Donald Trump, the 45th president of the United States, is a prominent American family active in real estate, entertainment, business, and politics. Trump's immediate family circle is the First Family of the United States. They are part of the broader Trump family originating from Germany. Donald Trump's mother, Mary Anne MacLeod, came from the Hebridean island of Lewis, off the west coast of Scotland. Trump has five children (between three wives) and nine grandchildren."}